{

    "global-translations": {
        "email-contact-link": "<a href='mailto:guilhermefortunato2008@gmail.com?subject=Hablemos%20de%20Negocios&body=Hola%20Guilherme...' target='_blank'><i class='fa-solid fa-envelope'></i></a>",

        "more-about-text": "Saber más",

        "beginner-text": "Principiante",
        "intermediate-text": "Intermediario",
        "advanced-text": "Avanzado",

        "certified-link": "Enlace Certificado"
    },
    
    "navigation" : {
        "navigation-home": "Hogar",
        "navigation-about-me": "Acerca de Mí",
        "navigation-projects": "Proyectos",
        "navigation-knowledge": "Conocimiento",
        "navigation-contact": "Contacto"
    },

    "apresentation": {
        "apresentation-text-h2": "Hola, soy <span>Guilherme Fortunato</span>",
        "apresentation-text-p": "Un niño que <span>transforma</span> líneas de código en <span>soluciones innovadoras.</span>",
        
        "apresentation-fullstack": "Desarrollador FullStack"
    },

    "end-to-end-applications": {
        "end-to-end-applications-text": "Aplicaciones creadas y desarrolladas de<br /><span>Extremo a Extremo</span>"
    },

    "about-me": {
        "about-me-title": "Acerca de Mí",
        "about-me-text": "Hola, mi nombre es Guilherme Fortunato Machado, actualmente tengo <b>16 años</b> y vivo en Brasil, desde los 9 años he tenido contacto con la programación y el desarrollo de juegos, a los 12 años creé mi primer sitio web, realicé el <b>curso Fullstack de Danki Code</b> y hoy tengo certificados como <b>Desarrollador de Juegos, Desarrollador Web y Programador de Aplicaciones</b>, tengo conocimientos en idiomas como <b>PHP, JavaScript y Lua</b> como lenguaje de programación para juegos. <b>Estoy interesado en trabajar o trabajar como freelance en el área Fullstack o Mobile</b>, y también estoy aprendiendo <b>Python</b> y en un futuro <b>Ruby</b>. Tengo conocimientos en tecnologías como <b>React JS, React Native y un poco NodeJS</b>, Front-End Frameworks como <b>Bootstrap, Materialize y SASS</b>, y en bases de datos lo que tengo más conocimientos de <b>MySQL</b>, también tengo algunos conocimientos de <b>MongoDB</b>."
    },

    "projects": {
        "projects-title": "Proyectos",
        "projects-more-button": "Más Proyectos",

        "projects-single": {
            
            "projects-single-prime_consultancy-title": "Asesoría Inmobiliaria Prime - 2022",
            "projects-single-prime_consultancy-description": "Desarrollé un sitio web Corporativo, con un sistema de panel de control para los empleados, generando informes en PDF y guardando documentos en la base de datos. Las tecnologías utilizadas fueron <b>Front-End (HTML5, CSS3, JavaScript), Bootstrap, PHP y Base de Datos MySQL</b>.",

            "projects-single-ibca_church-title": "App de la Iglesia IBCA - 2022",
            "projects-single-ibca_church-description": "Creé una aplicación para mi iglesia, usando <b>React Native y la plataforma Expo</b> para exportar la aplicación a <b>IOS y Android</b>.",

            "projects-single-dentistry-title": "Dentista/Odontología - 2023",
            "projects-single-dentistry-description": "Un sitio web que muestra el trabajo de un dentista, creado con <b>Vanilla HTML 5 & CSS 3</b>.",

            "projects-single-concessionaire-title": "Concesionario de vehículos especiales - 2023",
            "projects-single-concessionaire-description": "Desarrollé un sitio web para concesionarios usando <b>PHP y Front-End</b>, se puede adaptar y vender fácilmente a otros concesionarios.",

            "projects-single-combat_game-title": "Juego de Lucha en JavaScript - 2024",
            "projects-single-combat_game-description": "Un divertido juego para <b>2 personas</b> creado con los conceptos básicos de JavaScript orientado a objetos.",

            "projects-single-digital_agency-title": "Agencia Digital - 2022",
            "projects-single-digital_agency-description": "Pequeño proyecto desarrollado como modelo para vender a otras <b>agencias digitales</b> que quieran llegar a más clientes.",

            "projects-single-rbi_web-title": "RBI Web - 2023",
            "projects-single-rbi_web-description": "<b>Landing Page</b> desarrollada para una barbería que frecuento, utilizada principalmente para publicitar los servicios que ofrece la barbería, el <b>cliente también puede ubicar y saber dónde se encuentran las unidades de la barbería</b>.",

            "projects-single-weather_station-title": "Estación meteorológica - 2024",
            "projects-single-weather_station-description": "Aplicación para <b>IOs y Android</b> donde puedes tomar <b>notas del clima actual de la región</b> y exportarlas a una <b>hoja de cálculo de excel</b>, todas las notas (Temperatura, Viento dirección, rayos UV) se almacenan en una base de datos <b>Firebase</b>, en el futuro será posible generar gráficos en Excel con los datos almacenados.",

            "projects-single-rbi_app-title": "RBI App - 2023",
            "projects-single-rbi_app-description": "Aplicación móvil desarrollada como complemento a la <b>versión Web (RBI Web)</b>, realizada específicamente para <b>barberías</b>, donde se puede ver <b>horario del día, agenda, control de empleados</b> etcétera."

        }

    },

    "knowledge": {
        "knowledge-title": "Mi Conocimiento",
        "knowledge-modal-button": "Más Sobre Mis Conocimientos <i class='fa-solid fa-plus'></i>",

        "knowledge-soft-skills": {

            "soft-skills-title": "Habilidades Blandas",


            "soft-skills-fast_learning": {
                "soft-skills-fast_learning-title": "Aprendizaje <b>rápido</b>",
                "soft-skills-fast_learning-description": "Así como tengo autonomía y fácil adaptación, mi curva de aprendizaje es rápida, constante y exponencial."
            },

            "soft-skills-team_work": {
                "soft-skills-team_work-title": "<b>Trabajo en equipo</b>",
                "soft-skills-team_work-description": "Me encanta trabajar en equipo y aprender de mis compañeros, evolucionar junto a ellos y verlos triunfar junto a mí es una misión y un sueño."
            },

            "soft-skills-clean_organized": {
                "soft-skills-clean_organized-title": "<b>Ambiente de trabajo limpio y organizado</b>",
                "soft-skills-clean_organized-description": "Soy un hombre sumamente organizado que tiene TOC cuando ve algo fuera de lugar o algo sucio, esa es una regla para mí."
            },

            "soft-skills-autonomy": {
                "soft-skills-autonomy-title": "<b>Autonomía</b> para resolver <b>Problemas</b>",
                "soft-skills-autonomy-description": "Si es necesario, voy a lo más profundo de Internet para encontrar una solución a un problema en las aplicaciones que desarrollo, no puedo dormir sin haber solucionado un error primero y ciertamente no dependo de otros desarrolladores para hacerlo."
            },

            "soft-skills-respect_empathy": {
                "soft-skills-respect_empathy-title": "<b>Empatía y Respeto</b>",
                "soft-skills-respect_empathy-description": "Amar a los demás y respetarlos sin importar las diferencias es un principio para mí ya que “El respeto genera respeto”."
            },

            "soft-skills-communication": {
                "soft-skills-communication-title": "<b>Comunicación</b>",
                "soft-skills-communication-description": "En los últimos años me he centrado en evolucionar mi comunicación con las personas y esto me ha dado resultados increíbles. El arte de comunicar es hermoso."
            },

            "soft-skills-proactivity_focus": {
                "soft-skills-proactivity_focus-title": "<b>Proactividad y Enfoque</b>",
                "soft-skills-proactivity_focus-description": "Siempre estoy moviéndome y haciendo algo, y cuando estoy quieto me pregunto por qué, y poco después vuelvo a concentrarme."
            },

            "soft-skills-resilience": {
                "soft-skills-resilience-title": "<b>Resiliencia</b>",
                "soft-skills-resilience-description": "La gran mayoría de las personas suelen darse por vencidos ante la primera dificultad que aparece en el camino, pero yo voy más allá, rendirme no es una opción para mí. Me hace diferente, me hace mejor."
            },

            "soft-skills-flexibility_adaptation": {
                "soft-skills-flexibility_adaptation-title": "<b>Flexibilidad y Adaptabilidad</b>",
                "soft-skills-flexibility_adaptation-description": "I am flexible and tend to adapt easily to new technologies and new market trends around the world."
            }

        }
    },

    "contact": {
        "contact-call-to-action-text": "¿Hablemos?<br />Envíame un correo electrónico y<br /><a href='mailto:guilhermefortunato2008@gmail.com?subject=Hablemos%20de%20Negocios&body=Hola%20Guilherme...' target='_blank' title='Entra en Contacto Yo'>Entra en Contacto Yo.</a>"
    },

    "projects-modal": {
        "projects-modal-pre-title": "Proyecto",

        "projects-modal-button-deployed": "Proyecto Implementado",
        "projects-modal-button-repository": "Repositorio en Github",

        "projects-modal-single": {

            "projects-modal-single-prime_consultancy": {
                "projects-modal-single-title": "Asesoría Inmobiliaria Prime",
                "projects-modal-single-tags": "Sitio web - Panel de control - Generación de PDF",
                "projects-modal-single-description": "Desarrollé un sitio web complejo con <b>Panel de Control</b> y otras funcionalidades que agilizaron los procesos y resultados de la empresa hasta en un <b>100%</b>, las principales tecnologías y librerías utilizadas fueron el <b>Front -End </b> usando <b>JQuery y Bootstrap</b> como bibliotecas, <b>Back-End</b> usando <b>FPDF (Generador de PDF) y PHPMailer (Envía correos electrónicos)</b> como bibliotecas y <b>Base de Datos MySQL</b> para almacenar toda la información sobre clientes, procesos, etc. <br/> También se desarrolló un <b>Sistema de Respaldo</b> para la Base de Datos por seguridad en caso de que haya un problema que afecta los datos."
            },

            "projects-modal-single-ibca_church": {
                "projects-modal-single-title": "Iglesia de la aplicación IBCA",
                "projects-modal-single-tags": "Aplicación - Control de Información - Fechas y Notas Dinámicas",
                "projects-modal-single-description": "Una aplicación creada para la iglesia a la que asisto, desarrollada principalmente para registrar las fechas y eventos de la iglesia, y los miembros que participan en el <b>Grupo de Jóvenes</b> de la iglesia también pueden registrarse, desarrollado todo en <b>React Native</b> utilizando la plataforma <b>Expo</b> para exportar la aplicación a <b>Android e IOS</b>."
            },

            "projects-modal-single-dentistry": {
                "projects-modal-single-title": "Odontología",
                "projects-modal-single-tags": "Sitio web - Estático",
                "projects-modal-single-description": "Otro proyecto que también se desarrolló y surgió del curso de <b>Webmaster Front-End</b> de <b>Danki Code</b> pero que también se puede adaptar fácilmente y crear nuevas variaciones del sitio web que se pueden vender. para <b>Odontología</b>, creado usando <b>Vanilla HTML5 y CSS3</b>.<br/>El sitio web sirve para <b>mostrar el trabajo de la Odontología</b>, <b>se puede actualizar y se puede implementar un panel que muestre las citas del día para los dentistas.</b>"
            },

            "projects-modal-single-concessionaire": {
                "projects-modal-single-title": "Concesionario de autos especiales",
                "projects-modal-single-tags": "Sitio web - Varias páginas - Carga de página dinámica",
                "projects-modal-single-description": "Este proyecto fue tomado del curso <b>Back-End</b> de <b>Danki Code</b>, un proyecto un poco más complejo que tomó el sitio web desarrollado en el <b>Front-End</b>. curso donde se mejoró e implementó <b>PHP</b>.<br/>El cliente puede contactar con el concesionario a través del sitio web, <b>Puede ver de cerca los vehículos que vende el concesionario, con las especificaciones y valor del coche</b> esto acelera hasta <b>9 tiempos</b> los procesos del concesionario, <b>aportando productividad, agilidad y rapidez de resultados al concesionario</b>."
            },
            
            "projects-modal-single-combat_game": {
                "projects-modal-single-title": "Juego de Lucha",
                "projects-modal-single-tags": "Juego - Orientado a Objetos - Animaciones",
                "projects-modal-single-description": "Mi clase de secundaria necesitaba un juego para presentar en la <b>feria profesional</b> de este año, así que desarrollé este <b>juego en JavaScript</b>. Sencillo pero funcional."
            },

            "projects-modal-single-digital_agency": {
                "projects-modal-single-title": "Agencia digital",
                "projects-modal-single-tags": "Orientado a ventas - Estático",
                "projects-modal-single-description": "Plantilla básica pero que funciona muy bien para <b>captar más clientes y empresas</b> para <b>cerrar un trato con tu agencia.</b>"
            },

            "projects-modal-single-rbi_web": {
                "projects-modal-single-title": "RBI Web",
                "projects-modal-single-tags": "Sitio Web - Barbería - Promoción de Servicios",
                "projects-modal-single-description": "Sitio web estático, orientado a la venta y para que el <b>cliente conozca más sobre la barbería.</b><br/>El propietario de la barbería logró tener <b>siete veces</b> más control sobre los clientes que programaban citas, y también informó al cliente sobre el trabajo del barbero, <b>lo que llevó a concertar una cita.</b>"
            },

            "projects-modal-single-weather_station": {
                "projects-modal-single-title": "Estación meteorológica",
                "projects-modal-single-tags": "Aplicación - React Native - Hojas de cálculo de Excel",
                "projects-modal-single-description": "Un proyecto social en mi escuela llamado <b>Estación Meteorológica</b> necesitaba <b>más agilidad en el proceso de anotación</b> de los datos de la estación, por lo que me pidieron que <b>desarrollara esta aplicación</b> para que los estudiantes que formaron parte del proyecto pudieran tomar <b>notas y exportarlas</b> <b>100 veces más rápido.</b>"
            },

            "projects-modal-single-rbi_app": {
                "projects-modal-single-title": "RBI App",
                "projects-modal-single-tags": "Móvil - Barbería - Gestión Empresarial",
                "projects-modal-single-description": "Desarrollado y creado con el potente <b>React Native</b> junto con la tecnología <b>Expo</b>, el proyecto actualmente ha sido <b>descontinuado</b> pero puede adaptarse fácilmente y venderse a otras barberías.<br/>A través de la aplicación, el dueño de la barbería tenía control sobre sus establecimientos, <b>aumentando la productividad hasta 21 veces</b>, además de que todas las citas realizadas a través del sitio web aparecen en la aplicación, <b>Estos y otros problemas se resolvieron a través de la aplicación y el sitio web.</b>"
            }
            
        }
    },

    "knowledge-modal": {
        "knowledge-modal-subtitle-courses": "Cursos y Escuelas",
        "knowledge-modal-courses":{

            "knowledge-modal-courses-dankicode-title": "Danki Code - FullStack Master",
            "knowledge-modal-courses-dankicode-description": "Paquete Danki Code Full Stack Master, el cual contiene <b>más de 25 cursos</b> que te preparan para ser un verdadero desarrollador web, gran parte de mi conocimiento web vino de ahí.",

            "knowledge-modal-courses-alura1-title": "Alura - Análisis y Desarrollo de Sistemas",
            "knowledge-modal-courses-alura1-description": "En un curso ofrecido por el gobierno de Paraná a través de <b>Nueva Educación Secundaria</b>, aprendí un poco sobre solicitud de datos, modelo en cascada, etc.",

            "knowledge-modal-courses-alura2-title": "Alura - Desarrollo de juegos para principiantes",
            "knowledge-modal-courses-alura2-description": "A través del programa <b>Edutech</b> que se llevó a cabo en el 2021, participé y tuve acceso a los cursos de Alura que enseñaban a desarrollar juegos básicos usando <b>Scratch, JavaScript & GameMaker Studio</b>.",

            "knowledge-modal-courses-high_school-title": "Análisis y Desarrollo de Sistemas - Nueva Escuela Secundaria 2do Año - Paraná",
            "knowledge-modal-courses-high_school-description": "Actualmente estoy en el 2do año de New High School estudiando <b>Análisis y Desarrollo de Sistemas</b> el cual tiene una duración total de 3 años."

        },

        "knowledge-modal-subtitle-certificates": "Certificados",
        "knowledge-modal-certificates":{

            "knowledge-modal-certificates-programming_logic-title": "Lógica de Programación - Danki Code",
            "knowledge-modal-certificates-programming_logic-description": "La lógica de programación es la base de todo en el mundo de la programación.",

            "knowledge-modal-certificates-front_end-title": "Front-End - Danki Code",
            "knowledge-modal-certificates-front_end-description": "Enseñando desde los conceptos básicos y fundamentales del Front-End hasta conceptos más avanzados.",

            "knowledge-modal-certificates-front_end2-title": "Front-End 2.0 - Danki Code",
            "knowledge-modal-certificates-front_end2-description": "El curso enseñó Front-End de una manera más moderna, usando las últimas etiquetas <b>HTML 5</b> como <b>encabezado, sección, pie de página, etc</b> y también usando <b>flexbox</b>. b> dejando <b>flotar</b> en el pasado.",

            "knowledge-modal-certificates-web_design-title": "Diseño Web - Código Danki",
            "knowledge-modal-certificates-web_design-description": "Enseñó sobre <b>Experiencia de Usuario (UX)</b> y las mejores formas de crear un diseño hermoso, llamativo y saludable para su negocio.",

            "knowledge-modal-certificates-javascript-title": "JavaScript - Danki Code",
            "knowledge-modal-certificates-javascript-description": "Un lenguaje de programación famoso y potente utilizado principalmente en <b>Desarrollo Web</b>.",

            "knowledge-modal-certificates-app_development-title": "Desarrollo Móvil - Danki Code",
            "knowledge-modal-certificates-app_development-description": "Aprendí a desarrollar aplicaciones utilizando la <b>Biblioteca JavaScript</b> más famosa para desarrollar aplicaciones para <b>Android</b> y <b>IOS</b> que sería <b>React Native</b. >.",

            "knowledge-modal-certificates-firebase-title": "Firebase - Danki Code",
            "knowledge-modal-certificates-firebase-description": "El curso le enseñó cómo alojar sus aplicaciones utilizando la potente plataforma basada en la nube de <b>Google</b>.",

            "knowledge-modal-certificates-php-title": "PHP - Danki Code",
            "knowledge-modal-certificates-php-description": "Enseñó sobre PHP, sus fundamentos y conocimiento profundo del lenguaje.",

            "knowledge-modal-certificates-database-title": "Base de datos - Danki Code",
            "knowledge-modal-certificates-database-description": "Un curso que enseña las principales bases de datos relacionales y no relacionales utilizadas, que serían <b>MySQL</b> y <b>MongoDB</b> respectivamente.",

            "knowledge-modal-certificates-english_for_programmers-title": "Inglés para programadores - Danki Code",
            "knowledge-modal-certificates-english_for_programmers-description": "Aprendí un poco de inglés más dirigido a programadores y sus conceptos técnicos.",

            "knowledge-modal-certificates-alura_all_certificates-title": "Todos los Certificados - Alura",
            "knowledge-modal-certificates-alura_all_certificates-description": "Todos los cursos realizados y sus respectivas cargas de trabajo a lo largo de mi trayectoria estudiando en <b>Alura</b>."

        },

        "knowledge-modal-subtitle-idioms": "Idiomas",
        "knowledge-modal-idioms":{
            "idioms-brazilian-portuguese": "Portugués Brasileño (Nativo)",
            "idioms-english-united-states": "Inglés Estados Unidos",
            "idioms-spanish": "Español",
            "idioms-italian": "Italiano"
        }
    },

    "cookies": {
        "cookies-text": "<b>Gui Dev</b> utiliza cookies para mejorar su experiencia en nuestro sitio web.",

        "cookies-accept-button": "Acepto"
    },

    "footer": {
        "footer-all-rights-reserved": "&copy; 2024 - Desarrollado y creado por Guilherme Fortunato Machado."
    }

}
